# BuiltInFailures.InterferenceFailures Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..InterferenceFailures Class
BuiltInFailures Class Members See Also
---
Failures about Interference.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class InterferenceFailures
```

Visual Basic
---
```text
Public NotInheritable Class InterferenceFailures
```

Visual C++
---
```text
public ref class InterferenceFailures abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BuiltInFailures..::..InterferenceFailures
# See Also
BuiltInFailures..::..InterferenceFailures Members
Autodesk.Revit.DB Namespace